bases/Wim_Fo/projects/IMDEV-9530  Замеры ФО/ЗАМЕРЫ/FO_KeyOpsPerf/DataProcessors/ГрупповоеИсполнениеСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГрупповоеИсполнениеСделок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сделки</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/Wim_Fo/projects/IMDEV-9530  Замеры ФО/ЗАМЕРЫ/FO_KeyOpsPerf/DataProcessors/ГрупповоеИсполнениеСделок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Замер исполнения сделок (ключевая операция ИсполнениеСделок): шаги заполнения таблицы сделок (только при
// запуске регламентным заданием) и создания документов исполнения с проведением. Вес - число разных портфелей
// в таблице сделок; если портфелей нет - число строк, если и строк нет - 1. Строка таблицы - остаток плановой
// позиции по сделке (бумага или деньги), на каждую строку создается документ исполнения. Логика исполнения
// не меняется.
//
// Параметры:
//  РегламентноеЗадание - Булево - процедура вызвана регламентным заданием, таблица сделок заполняется здесь
//  ОбъектыНазначения - Произвольный - как в оригинале
//
&ИзменениеИКонтроль("СоздатьДокументыИсполнения")
Процедура FO_KeyOpsPerf_СоздатьДокументыИсполнения(РегламентноеЗадание = Ложь, ОбъектыНазначения = Неопределено) Экспорт

#Вставка
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
#КонецВставки
	Если РегламентноеЗадание Тогда
		ЗаполнитьТаблицуСделок();
	КонецЕсли;
#Вставка

	ПортфелиСделок = Сделки.Выгрузить(, "Портфель");
	ПортфелиСделок.Свернуть("Портфель");
	РазныеСделки = Сделки.Выгрузить(, "Сделка");
	РазныеСделки.Свернуть("Сделка");
	КоличествоСтрок = Сделки.Количество();
	Если ПортфелиСделок.Количество() > 0 Тогда
		ВесЗамера = ПортфелиСделок.Количество();
	ИначеЕсли КоличествоСтрок > 0 Тогда
		ВесЗамера = КоличествоСтрок;
	Иначе
		ВесЗамера = 1;
	КонецЕсли;
	Если РегламентноеЗадание Тогда
		РежимЗапуска = "регламентное задание";
	Иначе
		РежимЗапуска = "вручную";
	КонецЕсли;
	КомментарийЗамера = СтрШаблон("Строк: %1; Сделок: %2; Портфелей: %3; Запуск: %4",
		Формат(КоличествоСтрок, "ЧН=0; ЧГ=0"), Формат(РазныеСделки.Количество(), "ЧН=0; ЧГ=0"),
		Формат(ПортфелиСделок.Количество(), "ЧН=0; ЧГ=0"), РежимЗапуска);
	Если РегламентноеЗадание Тогда
		ОценкаПроизводительности.ЗакончитьЗамерВремени("ИсполнениеСделок.ЗаполнитьТаблицуСделок", НачалоЗамера,
			ВесЗамера, КомментарийЗамера);
	КонецЕсли;
	НачалоПроведения = ОценкаПроизводительности.НачатьЗамерВремени();
#КонецВставки

	ДатаДокумента = ?(ЗначениеЗаполнено(НаДату), НаДату, ТекущаяДатаСеанса());

	СозданныеДокументы = Новый Массив;

	Для Каждого Стр Из Сделки Цикл

		нДокумент = Документы.ИсполнениеПоСделке.СоздатьДокумент();
		нДокумент.Дата = ДатаДокумента;
		ЗаполнитьЗначенияСвойств(нДокумент, Стр);
		нДокумент.Записать(РежимЗаписиДокумента.Проведение);

		СозданныеДокументы.Добавить(нДокумент.Ссылка);

	КонецЦикла;
#Вставка

	ОценкаПроизводительности.ЗакончитьЗамерВремени("ИсполнениеСделок.Проведение", НачалоПроведения, ВесЗамера,
		КомментарийЗамера);
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ИсполнениеСделок", НачалоЗамера, ВесЗамера, КомментарийЗамера);
#КонецВставки

	Если СозданныеДокументы.Количество() И Не РегламентноеЗадание Тогда
		АдресРезультата = ПоместитьВоВременноеХранилище(СозданныеДокументы);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
